---
kind: type
id: T:Autodesk.Revit.DB.SpotDimension
source: html/f3c633ac-1595-cb8d-5c1b-66eb3eefb433.htm
---
# Autodesk.Revit.DB.SpotDimension

Object representing various types of SpotDimension

## Syntax (C#)
```csharp
public class SpotDimension : Dimension
```